CSI API ETABS v1

# cDStAustralian_AS4100_2020SetPreference Method

---

Sets the value of a steel design preference item

**Namespace:** ETABSv1
**Assembly:** ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (1.27.0.0)

Syntax

C#

VB

C++

F#

Copy

    int SetPreference(
    	int Item,
    	double Value
    )

    Function SetPreference (
    	Item As Integer,
    	Value As Double
    ) As Integer

    Dim instance As cDStAustralian_AS4100_2020
    Dim Item As Integer
    Dim Value As Double
    Dim returnValue As Integer

    returnValue = instance.SetPreference(Item,
    	Value)

    int SetPreference(
    	int Item,
    	double Value
    )

    abstract SetPreference :
            Item : int *
            Value : float -> int

#### Parameters

Item

    Type: SystemInt32
This is an integer between 1 and 17, inclusive, indicating the preference item
considered

  1. Multi-response case design
  2. Framing type
  3. Structural analysis method
  4. Steel type
  5. Capacity factor, Phi bending
  6. Capacity factor, Phi compression
  7. Capacity factor, Phi tension yielding
  8. Capacity factor, Phi tension fracture
  9. Capacity factor, Phi shear
  10. Consider deflection
  11. DL deflection limit, L/Value
  12. SDL + LL deflection limit, L/Value
  13. LL deflection limit, L/Value
  14. Total load deflection limit, L/Value
  15. Total camber limit, L/Value
  16. Pattern live load factor
  17. Demand/capacity ratio limit

Value

    Type: SystemDouble
The value of the considered preference item

  1. Multi-response case design
     * **1** \- Envelopes
     * **2** \- Step-by-step
     * **3** \- Last step
     * **4** \- Envelopes -- All
     * **5** \- Step-by-step -- All
  2. Framing type
     * **1** \- Moment frame
     * **2** \- Braced frame
  3. Structural analysis method
     * **1** \- General 2nd Order
     * **2** \- Amplified 1st Order
  4. Steel type
     * **1** \- Hot rolled
     * **2** \- Hot finished
     * **3** \- Cold form
     * **4** \- Stress relieved
     * **5** \- Lightly welded
     * **6** \- Heavily welded
  5. Capacity factor, Phi bending

Value > 0

  6. Capacity factor, Phi compression

Value > 0

  7. Capacity factor, Phi tension yielding

Value > 0

  8. Capacity factor, Phi tension fracture

Value > 0

  9. Capacity factor, Phi shear

Value > 0

  10. Consider deflection
     * 0 = No
     * Any other value = Yes
  11. DL deflection limit, L/Value

Value > 0

  12. SDL + LL deflection limit, L/Value

Value > 0

  13. LL deflection limit, L/Value

Value > 0

  14. Total deflection limit, L/Value

Value > 0

  15. Total camber limit, L/Value

Value > 0

  16. Pattern live load factor

Value >= 0

  17. Demand/capacity ratio limit

Value > 0

#### Return Value

Type: Int32
Returns zero if the item is successfully retrieved; otherwise, it returns a
nonzero value

Remarks

Examples

VB

Copy

    Public Sub Example()
       Dim SapModel As cSapModel
       Dim EtabsObject As cOAPI
       Dim ret As Integer = -1
       Dim Value As Double

    'create ETABS object
       Dim myHelper as cHelper = New Helper
       EtabsObject = myHelper.CreateObjectProgID("CSI.ETABS.API.ETABSObject")

    'start ETABS application
      ret = EtabsObject.ApplicationStart()

    'create SapModel object
       SapModel = EtabsObject.SapModel

    'initialize model
       ret = SapModel.InitializeNewModel()

    'create steel deck template model
       ret = SapModel.File.NewSteelDeck(4, 12, 12, 4, 4, 24, 24)

    'set steel design code
       ret = SapModel.DesignSteel.SetCode("AS 4100:2020")

    'set preference item
       ret = SapModel.DesignSteel.Australian_AS4100_2020.SetPreference(4, 6)

    'close ETABS
       EtabsObject.ApplicationExit(False)

    'clean up variables
       SapModel = Nothing
       EtabsObject = Nothing

    End Sub

See Also

#### Reference

cDStAustralian_AS4100_2020
Interface

ETABSv1 Namespace

ETABS®, SAFE®, SAP2000® and CSiBridge® are registered trademarks of Computers
and Structures, Inc.

Copyright © Computers and Structures, Inc. 2023. All rights
reserved.

support@csiamerica.com